In [3]:
import pandas as pd

df = pd.DataFrame({'A': [1,2,3], 'B': [4,5,6]})
df['A']= df['A'].apply(lambda x:x*2)
df

   A  B
0  2  4
1  4  5
2  6  6

In [38]:
import pandas as pd

# Example DataFrames
df1 = pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6]}, index=['X', 'Y', 'Z'])
df2 = pd.DataFrame({'B': [10, 20, 30], 'C': [40, 50, 60]}, index=['Y', 'Z', 'W'])
print(df1) 
print(df2)
df2
# Adding two DataFrames
result = df1 + df2
result

   A  B
X  1  4
Y  2  5
Z  3  6
    B   C
Y  10  40
Z  20  50
W  30  60

    A     B   C
W NaN   NaN NaN
X NaN   NaN NaN
Y NaN  15.0 NaN
Z NaN  26.0 NaN

In [40]:
result.fillna(1)
result

    A     B   C
W NaN   NaN NaN
X NaN   NaN NaN
Y NaN  15.0 NaN
Z NaN  26.0 NaN

In [41]:
result.dropna()
result

    A     B   C
W NaN   NaN NaN
X NaN   NaN NaN
Y NaN  15.0 NaN
Z NaN  26.0 NaN

In [54]:
s1=pd.Series([1,2], index=['a','b'])
s2=pd.Series([3,4], index=['b','c'])

result = s1*s2
result

a    NaN
b    6.0
c    NaN
dtype: float64

In [27]:
mean=result/2
mean

a    NaN
b    2.5
c    NaN
dtype: float64

In [32]:
import pandas as pd

# Load Titanic dataset
df = pd.read_csv(r"C:\Users\Ahmed\Downloads\archive (3)\tested.csv")

# Display basic information about the dataset
print("Head of the DataFrame:")
df.head()

Head of the DataFrame:

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [33]:
# Statistical summary of numerical columns
print("\nStatistical summary:")
df.describe()

Statistical summary:

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,418.000000,418.000000,418.000000,332.000000,418.000000,418.000000,417.000000
mean,1100.500000,0.363636,2.265550,30.272590,0.447368,0.392344,35.627188
std,120.810458,0.481622,0.841838,14.181209,0.896760,0.981429,55.907576
min,892.000000,0.000000,1.000000,0.170000,0.000000,0.000000,0.000000
25%,996.250000,0.000000,1.000000,21.000000,0.000000,0.000000,7.895800
50%,1100.500000,0.000000,3.000000,27.000000,0.000000,0.000000,14.454200
75%,1204.750000,1.000000,3.000000,39.000000,1.000000,0.000000,31.500000
max,1309.000000,1.000000,3.000000,76.000000,8.000000,9.000000,512.329200

In [34]:
# Calculate mean age grouped by passenger class
mean_age_by_class = df.groupby('Pclass')['Age'].mean()
print("\nMean age by passenger class:")
mean_age_by_class

Mean age by passenger class:

Pclass
1    40.918367
2    28.777500
3    24.027945
Name: Age, dtype: float64

In [35]:
# Calculate survival rate by gender
survival_rate_by_gender = df.groupby('Sex')['Survived'].mean() * 100
print("\nSurvival rate by gender (%):")
survival_rate_by_gender

Survival rate by gender (%):

Sex
female    100.0
male        0.0
Name: Survived, dtype: float64

In [42]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

In [70]:
df.isnull().sum().sum()

414

In [58]:
import pandas as pd

# Statistical summary of numerical columns
print("\nStatistical summary:")
df.describe()

Statistical summary:

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,418.000000,418.000000,418.000000,332.000000,418.000000,418.000000,417.000000
mean,1100.500000,0.363636,2.265550,30.272590,0.447368,0.392344,35.627188
std,120.810458,0.481622,0.841838,14.181209,0.896760,0.981429,55.907576
min,892.000000,0.000000,1.000000,0.170000,0.000000,0.000000,0.000000
25%,996.250000,0.000000,1.000000,21.000000,0.000000,0.000000,7.895800
50%,1100.500000,0.000000,3.000000,27.000000,0.000000,0.000000,14.454200
75%,1204.750000,1.000000,3.000000,39.000000,1.000000,0.000000,31.500000
max,1309.000000,1.000000,3.000000,76.000000,8.000000,9.000000,512.329200

In [94]:
# Calculate mean, mode, median, and standard deviation
mean_age = df['Age'].mean()
mode_age = df['Age'].mode()[0]  # Mode may have multiple values, so we take the first one
median_Fare = df['Fare'].mean()
mode = df['Cabin'].mode()[0]

print(f"\nMean Age: {mean_age:.2f}")
print(f"Mode Age: {mode_age}")
print(f"Median Age: {median_age}")
print(f"mean Fare: {median_Fare}")

Mean Age: 30.27
Mode Age: 30.272590361445783
Median Age: 35.627188489208635
mean Fare: 35.627188489208635

In [92]:
# Calculate mode of categorical variables
mode_sex = df['Sex'].mode()[0]
mode_embarked = df['Embarked'].mode()[0]

print(f"\nMode of Sex: {mode_sex}")
print(f"Mode of Embarked: {mode_embarked}")

Mode of Sex: male
Mode of Embarked: S

In [88]:
df['Age'].fillna(mean_age, inplace=True)
df['Fare'].fillna(median_Fare, inplace=True)

In [89]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          327
Embarked         0
dtype: int64

In [77]:
df.Cabin.head(20)

0     NaN
1     NaN
2     NaN
3     NaN
4     NaN
5     NaN
6     NaN
7     NaN
8     NaN
9     NaN
10    NaN
11    NaN
12    B45
13    NaN
14    E31
15    NaN
16    NaN
17    NaN
18    NaN
19    NaN
Name: Cabin, dtype: object

In [90]:
df['Cabin'].fillna(mode, inplace=True)

In [96]:
df.drop(columns=['Cabin'], inplace=True)

In [97]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Survived     418 non-null    int64
 2   Pclass       418 non-null    int64
 3   Name         418 non-null    object
 4   Sex          418 non-null    object
 5   Age          418 non-null    float64
 6   SibSp        418 non-null    int64
 7   Parch        418 non-null    int64
 8   Ticket       418 non-null    object
 9   Fare         418 non-null    float64
 10  Embarked     418 non-null    object
dtypes: float64(2), int64(5), object(4)
memory usage: 36.0+ KB